setup> cirread -v 
[ERROR]: Illegal option "" !!

setup> cirread -v ./null.v
[ERROR]: Error: cannot open file "./null.v" !!

setup> cirread -v ""
[ERROR]: Error: cannot open file """" !!

setup> cirread -v ./designs/SoCV/basic/a.v
Converted 0 1-valued FFs and 16 DC-valued FFs.

setup> cirread -v -r ./designs/SoCV/basic/b.v
Note: original circuit is replaced...
Converted 0 1-valued FFs and 10 DC-valued FFs.

setup> cirread -v -r ./designs/SoCV/basic/c.v
Note: original circuit is replaced...
Converted 0 1-valued FFs and 6 DC-valued FFs.

setup> cirread -v -r ./designs/SoCV/basic/a.v
Note: original circuit is replaced...
Converted 0 1-valued FFs and 16 DC-valued FFs.

setup> q -f

